app/controllers/api/base_controller.rb

    def set_current_user
      return unless @current_user_data

      @current_user = User.find_by(id: @current_user_data[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]