app/controllers/api/v1/articles_controller.rb

INSERT INTO "articles" ("title", "body", "published", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "My First Article"], ["body", "This is the content of my first article"], ["published", true], ["created_at", "2025-10-09 04:06:20.852494"], ["updated_at", "2025-10-09 04:06:20.852494"]]
---
      def create
        @article = Article.new(article_params)

        if @article.save

UPDATE "articles" SET "title" = $1, "body" = $2, "published" = $3, "updated_at" = $4 WHERE "articles"."id" = $5  [["title", "Updated Article Title"], ["body", "This article has been updated"], ["published", false], ["updated_at", "2025-10-09 04:06:37.790076"], ["id", 1]]
---
      def update
        if @article.update(article_params)