app/controllers/api/v1/documents_controller.rb

INSERT INTO "documents" ("filename", "content_type", "file_size", "file_path", "document_type", "extracted_text", "metadata", "checksum", "processed", "processed_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
      def upload
        cv_file = params[:cv]
        project_file = params[:project_report]

        if cv_file.blank? || project_file.blank?
          return render_error('Both CV and project report files are required', status: :bad_request)
        end

        begin
          # Ensure user is authenticated
          raise "User not authenticated" unless @current_user&.id

          # Validate and save CV file
          cv_data = FileService.validate_and_save_pdf(cv_file, @current_user.id)
          cv_document = Document.create!(**cv_data, document_type: 'cv')

INSERT INTO "documents" ("filename", "content_type", "file_size", "file_path", "document_type", "extracted_text", "metadata", "checksum", "processed", "processed_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
      def document_response(document)
        {
          id: document.id,
          filename: document.filename,
          document_type: document.document_type,
          file_size: document.file_size,
          processed: document.processed,
          created_at: document.created_at