app/controllers/api/v1/evaluations_controller.rb

SELECT "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT $2  [["id", 999], ["LIMIT", 1]]
SELECT "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "evaluation_jobs" ("job_id", "job_title", "cv_document_id", "project_document_id", "status", "cv_match_rate", "cv_feedback", "project_score", "project_feedback", "overall_summary", "processing_steps", "error_message", "retry_count", "started_at", "completed_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
      def create
        job_title = params.require(:job_title)
        cv_document_id = params.require(:cv_document_id)
        project_document_id = params.require(:project_document_id)

        cv_document = Document.find(cv_document_id)
        project_document = Document.find(project_document_id)

        # Validate document types
        unless cv_document.document_type == 'cv'
          return render_error('Invalid CV document', status: :bad_request)
        end

        unless project_document.document_type == 'project_report'
          return render_error('Invalid project report document', status: :bad_request)
        end

        # Ensure documents are processed
        unless cv_document.processed? && project_document.processed?
          return render_error('Documents are still being processed. Please wait and try again.', status: :unprocessable_entity)
        end

        # Create evaluation job
        evaluation_job = EvaluationJob.create!(
          job_title: job_title,
          cv_document: cv_document,
          project_document: project_document
        )

SELECT "evaluation_jobs".* FROM "evaluation_jobs" WHERE "evaluation_jobs"."job_id" = $1 LIMIT $2  [["job_id", "non-existent-job-id"], ["LIMIT", 1]]
---
      def show
        job_id = params[:id]
        evaluation_job = EvaluationJob.find_by!(job_id: job_id)