app/controllers/api/v1/users_controller.rb

      def register
        email = params[:email]
        password = params[:password]
        role = params[:role] || 'user'

        # Validation
        if email.blank?
          return render json: { error: 'Email is required' }, status: :bad_request
        end

        if password.blank?
          return render json: { error: 'Password is required' }, status: :bad_request
        end

        if password.length < 8
          return render json: { error: 'Password must be at least 8 characters long' }, status: :bad_request
        end

        # Check if user already exists
        if User.exists?(email: email.downcase)
---
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]

            active: true
          )

          if user.save
---
INSERT INTO "users" ("email", "password_hash", "role", "active", "last_login_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"