app/models/vector_embedding.rb

SELECT "vector_embeddings".* FROM "vector_embeddings" INNER JOIN "documents" ON "documents"."id" = "vector_embeddings"."document_id" WHERE "documents"."document_type" IN ($1, $2)  [["document_type", "job_description"], ["document_type", "scoring_rubric"]]
---
  scope :by_document_types, ->(types) { joins(:document).where(documents: { document_type: types }) }