app/jobs/evaluation_worker_job.rb

  def perform(evaluation_job_id)
    evaluation_job = EvaluationJob.find(evaluation_job_id)
---
SELECT "evaluation_jobs".* FROM "evaluation_jobs" WHERE "evaluation_jobs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]