app/jobs/extract_text_job.rb

SELECT "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def perform(document_id)
    document = Document.find(document_id)